{
  "footerFootnote": "We are <a href='https://info.nl'>INFO</a>, your digital partner who helps translate your business challenges into digital products with impact, since 1994.",
  "socialLinks": [
    { "href": "https://github.com/infonl", "iconName": "github" }
  ],
  "pageHelp": {
    "paragraphs": [
      {
        "headline": "Introduction",
        "values": [
          "The <a href='https://info.nl'>INFO</a> Tech Radar contains a high-level list of preferred technologies that we like to use for the solutions that we build for our clients. It also contains technologies that we would like to assess or trial as well as technologies that we want to put on hold.",
          "The INFO Tech Radar was built using the <a href='https://github.com/AOEpeople/techradar'>AOE People Tech Radar generator</a> and we continue to be inspired by the <a href='https://www.thoughtworks.com/radar'>ThoughtWorks Technology Radar</a>."
        ]
      },
      {
        "headline": "Purpose of the INFO Technology Radar",
        "values": [
          "The purpose of the INFO technology radar is:",
          "- To give focus on our INFO technology innovation strategy.",
          "- To help make technology decisions for our client teams.",
          "- To give guidance in the career growth paths of our technical employees",
          "- To share our technology strategy with our (potential new) clients and potential new employees."
        ]
      },
      {
        "headline": "Who maintains the INFO Technology Radar?",
        "values": [
          "This is the end-responsibility of the INFO tech leadership group. We will try our best to involve all relevant (mostly technical) people at INFO where we can and try to make the radar shared by all of us. Everyone at INFO can contribute to the technology radar."
        ]
      },
      {
        "headline": "How should it be used",
        "values": [
          "The INFO tech radar is (amongst other things) a preferred technology stack for new technical solutions in our teams. Read and use it when defining your team's technology vision for new solutions or major changes.",
          "There may be perfectly valid reasons to deviate from the INFO Tech Radar in our teams. We do ask our teams to always discuss such deviations in our tech leads group.",
          "We group the items on the radar in four quadrants."
        ]
      }
    ],
    "quadrants": [
      {
        "name": "Languages & Frameworks",
        "description": "Programming languages and software frameworks."
      },
      {
        "name": "Tools",
        "description": "Software products such as content management systems as well as software development tools."
      },
      {
        "name": "Techniques",
        "description": "Architectural techniques, elements of our software development process, best practices, and such."
      },
      {
        "name": "Platforms",
        "description": "Things that we build software on top of such as cloud-native platforms."
      }
    ],
    "rings": [
      {
        "name": "Adopt",
        "description": "We can clearly recommend this technology. We have used it for longer period of time in many teams and it has proven to be stable and useful."
      },
      {
        "name": "Trial",
        "description": "We have used it with success and recommend to have a closer look at the technology in this ring. The goal of items here is to look at them more closely, with the goal to bring them to the adopt level."
      },
      {
        "name": "Assess",
        "description": "We have tried it out and we find it promising. We recommend having a look at these items when you face a specific need for the technology in your project."
      },
      {
        "name": "Hold",
        "description": "This category is a bit special. Unlike the others, we recommend to stop doing or using something. That does not mean that they are bad and it often might be ok to use them in existing projects. But we move things here if we think we shouldn't do them anymore - because we see better options or alternatives now."
      }
    ],
    "sourcecodeLink": {
      "href": "https://github.com/infonl/info-techradar",
      "name": "INFO Tech Radar on GitHub",
      "description": "Contributions and source code of the INFO Tech Radar can be found here:"
    }
  },
  "legalInformationLink": "https://info.nl/wp-content/uploads/InfoNl-TERMS-AND-CONDITIONS.pdf"
}
